#include <iostream>
using namespace std;
/*
 * Программа: О себе
 * Автор: Даниил
 * Дата: 26.09.26
 * Группа: ИСПкр-252
 */

int main() {
    system("chcp 65001 > nul");
    // Заголовок
    cout << "================================" << endl;
    cout << "       Информация о студенте    " << endl;
    cout << "================================" << endl;

    // Личные данные
    cout << endl;
    cout << "Имя: Даниил" << endl;
    cout << "Группа: ИСПкр-252" << endl;
    cout << "Возраст: 16" << endl;

    // Увлечения
    cout << endl;
    cout << "Мои увлечения:" << endl;
    cout << "  1. волейбол" << endl;
    cout << "  2. комп. игры" << endl;
    cout << "  3. музыка" << endl;

    // Мотивация
    cout << endl;
    cout << "Почему я изучаю программирование:" << endl;
    cout << "Я изучаю программирование чтобы научиться создавать свои коды и программы" << endl;

    cout << endl;
    cout << "================================" << endl;

    return 0;
}
